Repository: univention/office365
Catalog: modules/univention/handler.d/*.po
Languages: de

source: Alias name of the connection.
de: Alias Name der Verbindung.

source: Description
de: Beschreibung

source: Displayed profile name when selecting a profile
de: Angezeigter Profilname, wenn ein Profil ausgewählt wird

source: General
de: Allgemein

source: Identifiers of service plans, which will be activated for the profile
de: Bezeichner der Servicepläne, die in dem Profil aktiviert werden

source: Identifiers of service plans, which will be deactivated for the profile
de: Bezeichner der Servicepläne, die in dem Profil deaktiviert werden

source: Internal Name of the subscription, as shown by cli tool
de: Interner Name der Subskription, wie vom cli Programm angezeigt

source: Management of Office 365 Azure AD connections
de: Verwaltung von Office 365 Azure AD Verbindungen

source: Management of office 365 profiles
de: Verwaltung von Office 365 Profilen

source: Office 365 Azure AD Connection
de: Office 365 Azure AD Verbindung

source: Office 365 Profile
de: Office 365 Profil

source: Office 365 users must have a primary e-mail address specified.
de: Office 365 Benutzer müssen eine Primäre E-Mailadresse angegeben haben.

source: Profile name
de: Profilname

source: Service plan blacklist
de: Blacklist der Servicepläne

source: Service plan whitelist
de: Whitelist der Servicepläne

source: Subscription identifier
de: Bezeichner der Subskription

source: Azure AD connection
de: Azure AD Verbindung
