Repository: univention/office365
Catalog: modules/univention/office365/*.po
Languages: de

source: ADConnection-ID '{}' has wrong format.
de: ADConnection-ID '{}' hat ein ungültiges Format.

source: Error converting identity provider certificate.
de: Fehler beim Umwandeln des Identity Provider Zertifikates.

source: Error downloading certificates from Azure for AD connection {adconnection}. Please run the wizard again.
de: Fehler beim Herunterladen der Zertifikate von Azure für AD Connection {adconnection}. Bitte führen Sie den Einrichtungsassistent erneut aus.

source: Error reading certificates of Azure AD connection {adconnection} from Azure. Please run the wizard again.
de: Fehler beim Lesen von Azures Zertifikaten für AD Connection {adconnection}. Bitte führen Sie den Einrichtungsassistent erneut aus.

source: Error reading identity provider certificate.
de: Fehler beim Lesen des Identity Provider Zertifikates

source: Error reading token of Azure AD connection {adconnection} received from Azure. Please run the wizard again.
de: Fehler beim lesen von Azures Token für AD Connection {adconnection}. Bitte führen Sie den Einrichtungsassistent erneut aus.

source: Error retrieving authentication token from Azure for AD connection {adconnection}.
de: Fehler beim Abrufen eines Authentifizierungs-Tokens von Azure für AD Connection {adconnection}.

source: Error writing SAML setup script.
de: Fehler beim Schreiben des SAML Installations-Skriptes.

source: The configuration of Azure AD connection {adconnection} is incomplete and misses some data. Please run the wizard again.
de: Die Konfiguration von Azure AD Connection {adconnection} ist unvollständig, da einige Daten fehlen. Bitte führen Sie den Einrichtungsassistent erneut aus.

source: The manifest is invalid: Invalid JSON document.
de: Das Manifest ist ungültig: ungültiges JSON Dokument.

source: The received token for Azure AD connection {adconnection} is not valid. Please run the wizard again.
de: Der empfangene Token für Azure AD Connection {adconnection} ist ungültig. Bitte führen Sie den Einrichtungsassistent erneut aus.
