Repository: univention/office365
Catalog: umc/js/*.po
Languages: de

source: <b>Warning!</b> The configuration has already been done. If you continue, the current connection settings will be replaced.
de: <b>Achtung!</b> Die Konfiguration wurde bereits durchgeführt. Die aktuellen Verbindungseinstellungen werden ersetzt wenn fortgefahren wird.

source: Additional configuration settings can be viewed in the help of the UCR variables <i>office365/attributes/anonymize</i> and <i>office365/attributes/static/.*</i>.
de: Weitere Einstellungsmöglichkeiten erfahren Sie in der Hilfe zu den UCR-Variablen <i>office365/attributes/anonymize</i> und <i>office365/attributes/static/.*</i>.

source: After the permission granting has succeeded continue this wizard by clicking on <i>Next</i>.
de: Nach dem erfolgreichen Setzen der Berechtigungen fahren Sie mit dem Assistenten durch klicken auf <i>Weiter</i> fort.

source: After the upload has succeeded, select the <i>API permissions</i> section.
de: Nach dem erfolgreichen Hochladen, öffnen Sie die <I>API-Berechtigungen</i> Sektion.

source: After this the browser window will close itself and the connection between UCS and the Office 365 application will be established.
de: Das Browserfenster wird sich dann von selbst schließen und die Verbindung zwischen UCS und der Office 365 Anwendung wird hergestellt.

source: After uploading the manifest you will be offered to download a file <i>manifest.json</i>. Store this file on your computer.
de: Nachdem das Manifest hochgeladen wurde, wird Ihnen eine Datei <i>manifest.json</i> zum Download angeboten. Speichern Sie diese Datei auf Ihrer Festplatte.

source: An error occurred
de: Es ist ein Fehler aufgetreten

source: An error occurred. It might help to restart the wizard.
de: Es ist ein Fehler aufgetreten. Eventuell hilft ein Neustart des Wizards.

source: As supported account type select <i>Accounts in this organizational directory only</i>.
de: Als unterstützten Kontotypen wählen Sie <i>Nur Konten in diesem Organisationsverzeichnis</i> aus.

source: Authorize UCS Office 365 application
de: UCS Office 365 Anwendung autorisieren

source: Authorize UCS to access application
de: Zugang zur Anwendung für UCS autorisieren

source: Click <i>NEW REGISTRATION</i> to add a new application to your directory.
de: Klicken Sie <i>NEUE REGISTRIERUNG</i> um Ihrem Directory eine neue Applikation hinzuzufügen.

source: Complete the wizard in the Azure portal by clicking the <i>Register</i> button.
de: Beenden Sie die den Wizard im Azure Portal durch Klicken auf den <i>Registrieren</i> Knopf.

source: Congratulations, the connection between UCS and Microsoft Azure has been established.
de: Glückwunsch, die Verbindung zwischen UCS und Microsoft Azure wurde hergestellt.

source: Connect Azure with UCS
de: Azure mit UCS verbinden

source: Continue by clicking on <i>Next</i>.
de: Fahren Sie durch klicken auf <i>Weiter</i> fort.

source: Copy the value for <i>FEDERATION METADATA DOCUMENT</i>.
de: Kopieren Sie den Wert <i>DOKUMENT MIT VERBUNDMETADATEN</i>.

source: Could not open a new browser window. Please deactivate all pop up blocker for this site.
de: Ein neues Browser Fenster konnte nicht geöffnet werden. Bitte deaktivieren Sie Pop-Up-Blocker für diese Seite.

source: Create an application for Office 365
de: Eine Anwendung für Office 365 erstellen

source: Download the {link} for Microsoft Powershell.
de: Laden Sie das {link} für Microsoft Powershell herunter.

source: Download the {link} which is used to prove the application’s identity when requesting a token.
de: Laden Sie den {link} herunter. Er wird verwendet um die Identität derApplikation, beim Holen eines Tokens, zu beweisen.

source: Enter a name for your application, e.g. <i>UCS Office 365</i>.
de: Geben Sie einen Namen für Ihre Applikation ein, z.B. <i>UCS Office 365</i>.

source: Execute the downloaded SAML configuration script, and authenticate with the Azure Active Directory domain administrator account.
de: Führen Sie das heruntergeladene SAML-Konfigurationsscript aus, und authentifizieren Sie sich mit Ihrem Azure Active Directory Domänenadministrator Account.

source: Federation metadata document
de: Verbund-Metadatendokument

source: For the UCS user account for which Office 365 is enabled, an account in the Microsoft directory is created and selected account attributes get synchronized from UCS to the Microsoft directory.
de: Für die UCS-Benutzerkonten, bei denen Office 365 aktiviert wurde, werden entsprechende Konten im Microsoft-Verzeichnis angelegt und ausgewählte Kontoattribute zu diesem synchronisiert.

source: Help
de: Hilfe

source: If existing applications are not shown, select <i>All applications</i> above the search field.
de: Werden bereits existierende Applikationen nicht angezeigt, wählen Sie über dem Suchfeld <i>Alle Anwendungen</i> aus.

source: If the download of the <i>manifest.json</i> file didn't start automatically <a download="manifest.json" href="/univention/command/office365/manifest.json" target="_blank">click here</a>.
de: Falls der Download der <i>manifest.json</i> Datei nicht automatisch gestartet wurde <a download="manifest.json" target="_blank" href="/univention/command/office365/manifest.json">hier klicken</a>.

source: If the script has been executed successfully, single sign-on configuration is completed. Continue by clicking on <i>Next</i>.
de: Wenn das Script erfolgreich ausgeführt wurde, ist die Einrichtung des Single Sign-on abgeschlossen. Fahren Sie durch klicken auf <i>Weiter</i> fort.

source: If you open this setup wizard again at a later time, a link on the first page will take you back to this instructions.
de: Falls Sie diesen Einrichtungsassistenten später erneut öffnen, können Sie durch einen Link auf der ersten Seite zu dieser Anleitung zurückkehren.

source: In addition, a Windows PC with at least Windows 7 is required to configure single sign-on for this domain.
de: Zusätzlich wird ein PC mit mindestens Windows 7 benötigt, um Single Sign-On für diese Domäne einzurichten.

source: In the <i>Certificate & secrets</i> section, click on <i>Upload certificate</i> and select the certificate file that was downloaded in the above step. Click on <i>Add</i> to add the certificate to the Azure app.
de: Klicken Sie in der Sektion <i>Zertifikate & Geheimnisse</i> auf <i>Zertifikat hochladen</i> und wählen Sie die im vorherigen Schritt heruntergeladene Zertifikatsdatei aus. Klicken Sie auf <i>Hinzufügen</i> um das Zertifikat zur Azure App hinzuzufügen.

source: In the <i>Manage</i> section, select <i>MANIFEST</i> and then <i>DOWNLOAD</i> on the top. The manifest file will be downloaded onto your computer.
de: Wählen Sie im <i>Verwalten</i> Menü <i>MANIFEST</i> und klicken Sie dort auf <i>HERUNTERLADEN</i>. Speichern Sie die Manifest-Datei auf Ihrem Computer.

source: In the category <i>Redirect URI</i>, make sure <i>Web</i> is selected in the dropdown. Copy the value below and paste it into the textfield in the Azure wizard.
de: Stellen Sie sicher, dass in der Sektion <i>Umleitungs-URI</i> im Drop-Down <i>Web</i> ausgewählt ist. Kopieren Sie den unteren Wert und fügen Sie ihn in das Feld im Azure-Assistenten ein.

source: In the following step some permissions have to be granted to UCS.
de: Im folgenden Schritt werden einige Berechtigungen für UCS akzeptiert.

source: Insert the copied value into the text box below.
de: Fügen Sie den kopierten Wert in die unten stehende Textbox ein.

source: Install the latest version of Microsoft Powershell, at least <a href="%s" target="_blank">Windows Management Framework 5.1</a> has to be installed.
de: Installieren Sie auf Ihrem Windows PC die aktuellste Version von Microsoft Powershell. Es muss mindestens das <a href="%s" target="_blank">Windows Management Framework 5.1</a> installiert sein.

source: It is necessary to <a href="https://%(url)s">run this wizard while using the Univention Management Console with a https connection.</a> If you continue without a https connection, the wizard will likely not complete.
de: Es ist notwendig <a href="https://%(url)s">den Einrichtungswizard in der Univention Management Console mit einer https Verbindung zu nutzen.</a> Wenn Sie ohne https Verbindung fortfahren, wird die Einrichtung wahrscheinlich nicht erfolgreich sein.

source: It will guide you through the process of setting up automatic provisioning of Microsoft Office 365 accounts for your user accounts.
de: Er wird Sie dabei begleiten, das automatische Erstellen von Microsoft Office 365 Konten durch UCS zu konfigurieren.

source: Login to the <a href="https://portal.azure.com/" target="_blank">Microsoft Azure portal</a>.
de: Melden Sie sich am <a href="https://portal.azure.com/" target="_blank">Microsoft Azure Portal</a> an.

source: Make sure that the verified domain which is set up in Azure Active Directory is <b>not</b> configured as the primary domain. Otherwise, the next step will fail.
de: Stellen Sie sicher, dass die im Azure Active Directory verifizierte Domäne <b>nicht</b> als primäre Domäne konfiguriert ist. Ansonsten wird der nächste Schritt fehlschlagen.

source: Make sure the newly created application is selected or open it by clicking on it.
de: Stellen Sie sicher, dass die neu erstellte Anwendung ausgewählt ist oder öffnen Sie sie durch einen Klick.

source: Microsoft Office 365 setup wizard
de: Microsoft Office 365 Einrichtungsassistent

source: Office 365 configuration
de: Office 365 Konfiguration

source: Office 365 setup complete
de: Office 365 Einrichtung abgeschlossen

source: On the app <i>Overview</i>, click on <i>ENDPOINTS</i>.
de: Klicken Sie in der App <i>Übersicht</i> auf <i>Endpunkte</i>.

source: On your Windows PC, follow the <a href="%s" target="_blank">instructions from Microsoft PowerShell Gallery</a> to install the <i>Microsoft Online Services PowerShell for Azure Active Directory</i> module.
de: Folgen sie auf Ihrem Windows PC den <a href="%s" target="_blank">Anweisungen in der Microsoft PowerShell Gallery</a>, um das <i>Microsoft Online Services PowerShell for Azure Active Directory</i> Modul zu installieren.

source: Open single sign-on configuration instructions
de: Single Sign-On Einrichtungsanweisungen öffnen

source: Open the <i>APP REGISTRATIONS</i> module.
de: Öffnen Sie das <i>App-Registrieren</i> Modul.

source: Please follow the next steps to create a new application in the Azure active directory:
de: Bitte folgen Sie den nächsten Schritten, um eine neue Anwendung im Azure Active Directory zu erstellen:

source: Please insert the federation metadata document URL here...
de: Bitte fügen Sie die Verbund-Metadatendokument URL hier ein...

source: Please upload the manifest that you just downloaded from the Azure Portal by using the upload button below. (The downloaded manifest is a file with the same name as the app and ends in ".json".)
de: Bitte laden Sie das Manifest, das Sie gerade im Azure Portal heruntergeladen haben, mit dem unten stehenden Upload-Button hoch. (Das Manifest ist eine Datei mit den Namen der App und endet auf ".json".)

source: SAML configuration script
de: SAML-Konfigurationsscript

source: SIGN-ON URL
de: URL FÜR ANMELDUNG

source: Select the Azure Active Directory service. In case you have multiple Active Directories, click <i>Switch directory</i> to choose the one you wish to synchronize with UCS.
de: Wählen Sie den Azure Active Directory Dienst aus. (Sollten Sie mehrere Active Directories haben, klicken Sie auf <i>Verzeichnis wechseln</i> um das auszuwählen, das mit UCS synchronisiert werden soll.

source: Select your app, <i>MANIFEST</i> and <i>UPLOAD</i> the manifest in the Azure dashboard.
de: Wählen Sie Ihre App, <i>MANIFEST</i> und <i>HOCHLADEN</i> im Azure Dashboard.

source: Single Sign-On setup
de: Single Sign-On Einrichtung

source: Synchronized users can log into Office 365 by using the link on the <a href="/univention/" target="_blank">UCS portal</a>.
de: Synchronisierte Benutzer können sich bei Office 365 anmelden, indem Sie den Link auf dem <a href="/univention/" target="_blank">UCS Portal</a> nutzen.

source: The UCS SAML identity provider has to be connected to Azure by running a Windows Powershell script.
de: Der UCS SAML Identity Provider muss über ein Windows Powershell Script mit Azure verbunden werden.

source: The configuration of synchronized attributes can be done via Univention Config Registry.
de: Die zu synchronisierenden Attribute können per Univention Config Registry eingestellt werden.

source: The connection between UCS and the Microsoft Azure application has to be authorized now.
de: Die Verbindung zwischen UCS und der Microsoft Azure Anwendung muss nun autorisiert werden.

source: The manifest is a JSON file which contains all necessary information required to connect UCS with your active directory.
de: Das Manifest ist eine JSON-Datei, die alle notwendigen Informationen beinhaltet, um UCS mit dem Active Directory zu verbinden.

source: The permissions have already been configured by the manifest. Click the <i>Grant admin consent for ...</i> button and <i>Yes</i> in the following dialog.
de: Die Berechtigungen wurden bereits mit dem Manifest konfiguriert. Klicken Sie auf <i>Administratorzustimmung für ... erteilen</i> und im anschließenden Dialog auf <i>Ja</i>.

source: The setup wizard now needs the domain that was verified during the configuration of the Office 365 account. Insert it into the text box below.
de: Der Einrichtungsassistent benötigt nun die Domäne, die während der Konfiguration des Office 365 Konto, eingerichtet wurde. Fügen Sie ihn in das unten stehende Eingabefeld ein.

source: This wizard helps you to configure the connection between UCS and Microsoft Office 365.
de: Dieser Einrichtungsassistent hilft Ihnen die Verbindung zwischen UCS und Microsoft Office 365 zu konfigurieren.

source: To allow UCS to synchronize selected user accounts a new application have to be added in the active directory.
de: Um UCS zu erlauben, ausgewählte Benutzerkonten zu synchronisieren, muss eine neue Anwendung im Active Directory hinzugefügt werden.

source: To finish configuration, single sign-on has to be configured for the Office 365 domain. Microsoft only supports to configure single sign-on by running a Microsoft Powershell script on a Windows PC.
de: Um die Konfiguration abzuschließen muss Single Sign-on für die Office 365 Domäne eingerichtet werden. Microsoft bietet für das Einrichten der Single Sign-on Verbindung nur die Möglichkeit, dies durch Ausführen eines Microsoft Powershell Scripts auf einem Windows PC zu konfigurieren.

source: To integrate Office 365 into UCS the manifest of the new application has to be downloaded.
de: Um Office 365 in UCS zu integrieren, ist es notwendig, das Manifest der neuen Anwendung herunterzuladen.

source: To learn more about configuring individual subscriptions and service plans for users, see <a href="%s" target="_blank">the Office 365 Connector documentation</a>
de: Weitere Informationen über die Konfiguration individueller Subskriptionen und Service Plänen für Benutzer finden Sie in der <a href="%s" target="_blank"> Office 365 Connector Dokumentation</a>

source: To upload the manifest in the panel click on <i>SELECT A FILE</i> and choose the previously downloaded <i>manifest.json</i>. Click on <i>Save</i> to complete the upload.
de: Um das Manifest in dem Panel hochzuladen, klicken Sie auf <i>DATEI AUSWÄHLEN</i> und wählen Sie die zuvor heruntergeladene <i>manifest.json</i> Datei aus.

source: To use the single sign-on script, your Windows PC must have at least installed the <a href="%s" target="_blank">.NET runtime environment version 4.5.1.</a>.
de: Um das Single Sign-On Konfigurationsscript nutzen zu können, muss auf dem Windows PC mindestens die <a href="%s" target="_blank">.NET Laufzeitumgebung in Version 4.5.1</a> installiert sein.

source: To use this app you need a Microsoft Office 365 admin account, a global administrator account in the corresponding Azure AD and a <a href="https://azure.microsoft.com/en-us/documentation/articles/active-directory-add-domain/" target="_blank">verified domain</a>.
de: Um diese App zu verwenden wird ein Microsoft Office 365 Administrator Konto, ein globales Administrator Konto im entsprechenden Azure AD und eine <a href="https://azure.microsoft.com/de-de/documentation/articles/active-directory-add-domain/" target="_blank">verifizierte Domäne</a> benötigt.

source: UCS modified the manifest to include all information which Azure needs to accept connections from UCS. The modified manifest now has to be uploaded to Azure.
de: UCS hat das Manifest modifiziert, damit es alle Informationen beinhaltet, die Azure benötigt, um Verbindungen von UCS zu akzeptieren. Das modifizierte Manifest muss nun in Azure hochgeladen werden.

source: Upload manifest
de: Manifest hochladen

source: Upload manifest to UCS
de: Manifest zu UCS hochladen

source: Upload updated manifest
de: Aktualisiertes Manifest hochladen

source: Users can now single sign on into the Office 365 account.
de: Benutzer können nun Single Sign-On zu Office 365 benutzen.

source: Verified domain name
de: Verifizierter Domänenname

source: Via the Univention Config Registry variable <i>office365/attributes/sync</i> can be configured which LDAP attributes (e.g. given name, surname, etc.) of a user account are sychronized.
de: Über die UCR-Variable <i>office365/attributes/sync</i> ist konfigurierbar, welche LDAP-Attribute (z.B. Vorname, Nachname, etc.) eines Benutzerkontos synchronisiert werden.

source: Warning
de: Warnung

source: Welcome to the <a href="https://products.office.com/" target="_blank">Microsoft Office 365</a> setup wizard.
de: Willkommen beim <a href="https://products.office.com/" target="_blank">Microsoft Office 365</a> Einrichtungsassistenten.

source: Welcome to the Microsoft Office 365 setup wizard. A few steps are needed to complete the configuration process.
de: Willkommen zum Microsoft Office 365 Einrichtungsassistent. Es sind einige Schritte notwendig, um den Konfigurationsprozess fertigzustellen.

source: Welcome to the Office 365 configuration
de: Willkommen zur Office 365 Konfiguration

source: When you click on the button below a a new browser window will be opened. Please select your account and log in if necessary and click on <i>Accept</i> to permit the permission request.
de: Wenn Sie auf den unten stehenden Button klicken, wird ein neues Browserfenster geöffnet. Melden Sie sich ggf. mit Ihrem Konto an und klicken auf <i>Akzeptieren</i> um die Berechtigungsanfrage zu bestätigen.

source: You can enable the UCR variable <i>office365/groups/sync</i> to synchronize the groups of the enabled Office 365 users.
de: Sie können die UCR-Variable <i>office365/groups/sync</i> aktivieren, um die Gruppen der für Office 365 aktivierten Benutzer zu synchronisieren.

source: You can now enable the Microsoft Azure synchronization for users on the <i>Office 365</i> tab in the %s.
de: Sie können nun die Microsoft Azure Synchronisation für Benutzer im <i>Office 365</i>-Tab im %s aktivieren.

source: You may add or remove attributes from the list by using the %s.
de: Sie können mithilfe des %s Attribute von der Liste löschen oder hinzufügen.

source: You need a <a href="%(domain)s" target="_blank">verified domain</a> and access to the <a href="%(dev)s" target="_blank">Microsoft Azure Portal</a> with a Microsoft Office 365 administrator account.
de: Sie benötigen eine <a href="%(domain)s" target="_blank">verifizierte Domäne</a> und Zugang mit einem Microsoft Office 365 Administratorkonto zum <a href="%(dev)s" target="_blank">Microsoft Azure Portal</a>.

source: app_name_EN.png
de: app_name_DE.png

source: app_registrations_EN.png
de: app_registrations_DE.png

source: azure_upload_manifest_window_EN.png
de: azure_upload_manifest_window_DE.png

source: copy_adconnection_id_EN.png
de: copy_adconnection_id_DE.png

source: domain name (e.g. univention.de)
de: Domänenname (z.B. univention.de)

source: endpoints_EN.png
de: endpoints_DE.png

source: grant_perms_EN.png
de: grant_perms_DE.png

source: grant_perms_yes_EN.png
de: grant_perms_yes_DE.png

source: https://azure.microsoft.com/en-us/documentation/articles/active-directory-add-domain/
de: https://azure.microsoft.com/de-de/documentation/articles/active-directory-add-domain/

source: manage_manifest_EN.png
de: manage_manifest_DE.png

source: ms_authorize_screen_text_and_image_EN.png
de: ms_authorize_screen_text_and_image_DE.png

source: public certificate key
de: Öffentlicher Zertifikatsschlüssel

source: required_perms_btn_EN.png
de: required_perms_btn_DE.png

source: saml_setup_script_windows_EN.png
de: saml_setup_script_windows_DE.png

source: sso-login_EN.png
de: sso-login_DE.png

source: top_bar_add_app_EN.png
de: top_bar_add_app_DE.png

source: umc_office365_EN.png
de: umc_office365_DE.png

source: upload_certificate_EN.png
de: upload_certificate_DE.png
